# Terraform plan for production
  
  ```
  Plan: 1 to add, 0 to change, 0 to destroy
  ```

  <details>
  <summary>Terraform Plan Details</summary>

  ```
  google_storage_bucket.terraform_remote_backend: Refreshing state... [id=terraform-remote-backend.piny940.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.clubroom.google_storage_bucket.clubroom will be created
  + resource "google_storage_bucket" "clubroom" {
      + effective_labels            = {
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "service"                    = "home-cluster"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "clubroom.piny940.com"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "service"                    = "home-cluster"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
  ```

  </details>
